{
  "work": [
    {
      "company": "Data Annotations",
      "dates": "Jun. 2025 - Present",
      "position": "Data Annotator",
      "location": "Remote",
      "highlights": [
        "Evaluated and revised AI-generated responses to coding prompts, ensuring alignment with best practices, efficiency, and accuracy.",
        "Improve and assess AI-generated code across multiple languages and their libraries and frameworks, such as Python, Java, JavaScript, Typescript, React, and Bash.",
        "Reviewed and improved the AI-generated code across a broad range of tasks, including API development, algorithm questions, front-end implementation, and full-stack projects.",
        "Developed fine-grained evaluation criteria to model AI-generated responses, with a focus on clarity, robustness, and alignment with coding standards."
      ]
    },
    {
      "company": "Thaddeus Resource Center",
      "dates": "Jul 2024 - Jan 2025",
      "position": "Web Development Intern",
      "location": "Remote",
      "highlights": [
        "Inherited and analyzed a large legacy codebase, maintaining existing functionality while implementing new features designed to integrate seamlessly with established systems and architecture.",
        "Developed and maintained dynamic, responsive user interfaces using React and Next.js, enhancing user experience and front-end performance.",
        "Identified and resolved a critical bug that was causing a loss of over 50,000 browser reads per day, resulting in a significant improvement in system efficiency and data tracking accuracy.",
        "Reviewed and refactored peer code, focusing on consistency, maintainability, and adherence to best practices."
      ]
    },
    {
      "company": "eBryIT, Inc.",
      "dates": "Summer 2024 & 2025",
      "position": "Computer Techician",
      "location": "Phoenix, AZ",
      "highlights": [
        "Imaged and configured over 10,000 client machines, ensuring consistent software environments and adherence to enterprise deployment.",
        "Automated device setup processes using scripting tools and batch workflows to streamline imaging, BIOS configuration, and domain joining.",
        "Collaborated with clients to schedule deployments and ensure seamless delivery and integration into existing infrastructure."
      ]
    }
  ],
  "projects": [
    {
      "name": "Deep Work CLI",
      "github": "https://github.com/Raul-Catalan/dw-cli",
      "livelink": "https://raul-catalan.github.io",
      "technologies": [
        "Python",
        "SQLite",
        "Typer",
        "Textual",
        "Rich",
        "CRUD"
      ],
      "highlights": [
        "Created a cli tool that can be forked and used per the user device",
        "This was built with the goal of creating a streak counter of deep work hours for users who frequently use the terminal",
        "This was built in Python and uses Typer and Textual framework heavily for creating cli tools."
      ],
      "summary": "This portfolio was made to showcase my projects, it was written with raw HTML, CSS, and JavaScript. No Libraries were used when creating the site. Hosted by Github Pages."
    },
    {
      "name": "Portfolio",
      "github": "https://github.com/Raul-Catalan/Raul-Catalan.github.io",
      "livelink": "",
      "technologies": [
        "HTML",
        "CSS",
        "JavaScript",
        "JSON",
        "Github Pages",
        "CI/CD"
      ],
      "highlights": [
        "Designed a minimalistic style portfolio to showcase who I am and some of my work.",
        "Written in HTML, CSS, and Javascript to create a static webpage to be hosted on Github Pages utilizing CI/CD best practices."
      ],
      "summary": "This portfolio was made to showcase my projects, it was written with raw HTML, CSS, and JavaScript. No Libraries were used when creating the site. Hosted by Github Pages."
    }
  ]
}